FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
static inline as5600_err_t as5600_bus_read_data(void* user,
                                                uint8_t address,
                                                uint8_t* data,
                                                size_t data_size)
{
    joint_config_t* config = (joint_config_t*)user;

    return HAL_I2C_Mem_Read(config->as5600_i2c_bus,
                            config->as5600_i2c_address << 1U,
                            address,
                            I2C_MEMADD_SIZE_8BIT,
                            data,
                            data_size,
                            100) == HAL_OK
               ? AS5600_ERR_OK
               : AS5600_ERR_FAIL;
}

static inline as5600_err_t as5600_initialize_chip(as5600_t* as5600,
                                                  float32_t min_angle,
                                                  float32_t max_angle,
                                                  bool magnet_polarity)
{
    as5600_status_reg_t status;
    as5600_err_t err = as5600_get_status_reg(as5600, &status);
    if (err != AS5600_ERR_OK) {
        return err;
    }

    float32_t angle_range = (max_angle - min_angle);

    uint16_t min_raw = (uint16_t)(min_angle / angle_range * 4095.0F);
    uint16_t max_raw = (uint16_t)(max_angle / angle_range * 4095.0F);

    as5600_zpos_reg_t zpos = {.zpos = min_raw & 0x0FFF};
    err = as5600_set_zpos_reg(as5600, &zpos);
    if (err != AS5600_ERR_OK) {
        return err;
    }

    as5600_mpos_reg_t mpos = {.mpos = max_raw & 0x0FFF};
    err = as5600_set_mpos_reg(as5600, &mpos);
    if (err != AS5600_ERR_OK) {
        return err;
    }

    as5600_conf_reg_t conf = {.wd = AS5600_WATCHDOG_OFF,
                              .fth = AS5600_SLOW_FILTER_X16,
                              .sf = AS5600_SLOW_FILTER_X16,
                              .pwmf = AS5600_PWM_FREQUENCY_115HZ,
                              .outs = AS5600_FAST_FILTER_THRESH_SLOW,
                              .hyst = AS5600_HYSTERESIS_OFF,
                              .pm = AS5600_POWER_MODE_NOM};
    err = as5600_set_conf_reg(as5600, &conf);
    if (err != AS5600_ERR_OK) {
        return err;
    }

    as5600_zmco_reg_t zmco;
    err = as5600_get_zmco_reg(as5600, &zmco);
    if (err != AS5600_ERR_OK) {
        return err;
    }

    return as5600_set_direction(as5600, (as5600_direction_t)magnet_polarity);
}

static inline ina226_err_t ina226_bus_initialize(void* user)
{
    joint_config_t* config = (joint_config_t*)user;

    return HAL_I2C_IsDeviceReady(config->ina226_i2c_bus,
                                 config->ina226_i2c_address << 1U,
                                 3U,
                                 10U) == HAL_OK
               ? INA226_ERR_OK
               : INA226_ERR_FAIL;
}

static inline ina226_err_t ina226_bus_deinitialize(void* user)
{
    return INA226_ERR_OK;
}

static inline ina226_err_t ina226_bus_write_data(void* user,
                                                 uint8_t address,
                                                 uint8_t const* data,
                                                 size_t data_size)
{
    ATLAS_ASSERT(user && data);

    joint_config_t* config = (joint_config_t*)user;

    return HAL_I2C_Mem_Write(config->ina226_i2c_bus,
                             config->ina226_i2c_address << 1U,
                             address,
                             I2C_MEMADD_SIZE_8BIT,
                             (uint8_t*)data,
                             data_size,
                             100) == HAL_OK
               ? INA226_ERR_OK
               : INA226_ERR_FAIL;
}

static inline ina226_err_t ina226_bus_read_data(void* user,
                                                uint8_t address,
                                                uint8_t* data,
                                                size_t data_size)
{
    ATLAS_ASSERT(user && data);

    joint_config_t* config = (joint_config_t*)user;

    return HAL_I2C_Mem_Read(config->ina226_i2c_bus,
                            config->ina226_i2c_address << 1U,
                            address,
                            I2C_MEMADD_SIZE_8BIT,
                            data,
                            data_size,
                            100) == HAL_OK
               ? INA226_ERR_OK
               : INA226_ERR_FAIL;
}

float32_t ina226_current_range_to_scale(float32_t);

static inline ina226_err_t ina226_initialize_chip(ina226_t* ina226,
                                                  float32_t min_current,
                                                  float32_t max_current)
{
    return INA226_ERR_OK;
}

static inline step_motor_err_t step_motor_device_initialize(void* user)
{
    joint_manager_t* manager = (joint_manager_t*)user;

    drv8825_set_enable(&manager->drv8825, true);
    drv8825_set_direction(&manager->drv8825, DRV8825_DIRECTION_STOP);
    drv8825_set_microstep(&manager->drv8825, manager->parameters.microstep);

    return STEP_MOTOR_ERR_OK;
}

static inline step_motor_err_t step_motor_device_deinitialize(void* user)
{
    joint_manager_t* manager = (joint_manager_t*)user;

    drv8825_set_enable(&manager->drv8825, true);
    drv8825_set_direction(&manager->drv8825, DRV8825_DIRECTION_STOP);

    return STEP_MOTOR_ERR_OK;
}

static inline step_motor_err_t step_motor_device_set_frequency(
    void* user,
    uint32_t frequency)
{
    ATLAS_ASSERT(user);

    joint_manager_t* manager = (joint_manager_t*)user;

    drv8825_set_frequency(&manager->drv8825, frequency);

    return STEP_MOTOR_ERR_OK;
}

static inline step_motor_err_t step_motor_device_set_direction(
    void* user,
    step_motor_direction_t direction)
{
    ATLAS_ASSERT(user);

    joint_manager_t* manager = (joint_manager_t*)user;

    drv8825_set_direction(&manager->drv8825, (drv8825_direction_t)direction);

    return STEP_MOTOR_ERR_OK;
}

static inline motor_driver_err_t motor_driver_motor_initialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_motor_deinitialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

