FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    step_motor_update_step_count(&manager->motor);

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_notify_handler(joint_manager_t* manager,
                                                joint_notify_t notify)
{
    ATLAS_ASSERT(manager);

    if ((notify & JOINT_NOTIFY_DELTA_ELAPSED) == JOINT_NOTIFY_DELTA_ELAPSED) {
        ATLAS_RET_ON_ERR(joint_manager_notify_delta_elapsed_handler(manager));
    }
    if ((notify & JOINT_NOTIFY_PWM_PULSE) == JOINT_NOTIFY_PWM_PULSE) {
        ATLAS_RET_ON_ERR(joint_manager_notify_pwm_pulse_handler(manager));
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_event_start_handler(
    joint_manager_t* manager,
    joint_event_payload_start_t const* start)
{
    ATLAS_ASSERT(manager && start);
    ATLAS_LOG_FUNC(TAG);

    if (manager->is_running) {
        return ATLAS_ERR_ALREADY_RUNNING;
    }

    system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT,
                            .type = SYSTEM_EVENT_TYPE_JOINT_STARTED,
                            .payload.joint_started = {}};
    if (!joint_manager_send_system_event(&event)) {
        return ATLAS_ERR_FAIL;
    }

    manager->is_running = true;
    manager->state = ATLAS_JOINT_STATE_READY;

#ifdef DELTA_TEST
    manager->reference.delta_time = 0.01F;
    manager->reference.position = 100.0F;
    xTimerStart(timer_manager_get(TIMER_TYPE_DELTA_TEST), pdMS_TO_TICKS(1));
#endif

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_event_stop_handler(
    joint_manager_t* manager,
    joint_event_payload_stop_t const* stop)
{
    ATLAS_ASSERT(manager && stop);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT,
                            .type = SYSTEM_EVENT_TYPE_JOINT_STOPPED,
                            .payload.joint_stopped = {}};
    if (!joint_manager_send_system_event(&event)) {
        return ATLAS_ERR_FAIL;
    }

    manager->is_running = false;
    manager->state = ATLAS_JOINT_STATE_IDLE;

    return ATLAS_ERR_OK;
}

static inline bool joint_manager_send_response(
    atlas_joint_response_t const* response)
{
    ATLAS_ASSERT(response);

    system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT,
                            .type = SYSTEM_EVENT_TYPE_JOINT_RESPONSE,
                            .payload.joint_response.response = *response};
    return joint_manager_send_system_event(&event);
}

static atlas_err_t joint_manager_command_get_state_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_get_state_t const* get_state)
{
    ATLAS_ASSERT(manager && get_state);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_GET_STATE};

    if (manager->state != ATLAS_JOINT_STATE_UNKNOWN) {
        response.payload.get_state.state = manager->state;
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

    if (!joint_manager_send_response(&response)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_command_set_state_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_set_state_t const* set_state)
{
    ATLAS_ASSERT(manager && set_state);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_SET_STATE};

    if ((manager->state == ATLAS_JOINT_STATE_READY &&
         set_state->state == ATLAS_JOINT_STATE_RUNNING) ||
        (manager->state == ATLAS_JOINT_STATE_RUNNING &&
         set_state->state == ATLAS_JOINT_STATE_READY)) {
        manager->state = set_state->state;
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

    if (!joint_manager_send_response(&response)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_command_set_reference_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_set_reference_t const* set_reference)
{
    ATLAS_ASSERT(manager && set_reference);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_SET_REFERENCE};

    if (manager->state == ATLAS_JOINT_STATE_RUNNING) {
        manager->reference = set_reference->reference;
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

    if (!joint_manager_send_response(&response)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_command_get_measure_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_get_measure_t const* get_measure)
{
    ATLAS_ASSERT(manager && get_measure);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_GET_MEASURE};

    if (manager->state == ATLAS_JOINT_STATE_RUNNING) {
        response.payload.get_measure.measure = manager->measure;
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

    if (!joint_manager_send_response(&response)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_command_set_parameters_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_set_parameters_t const* set_parameters)
{
    ATLAS_ASSERT(manager && set_parameters);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_SET_PARAMETERS};

    if (manager->state == ATLAS_JOINT_STATE_READY) {
        if (!joint_manager_deinitialize_drivers(manager)) {
            return ATLAS_ERR_FAIL;
        }
        manager->parameters = set_parameters->parameters;
        if (!joint_manager_initialize_drivers(manager)) {
            return ATLAS_ERR_FAIL;
        }
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

